common/models/wrappers/CategoryWrapper.php

    public static function findByPath($path)
    {
        $domens = explode('/', trim($path, '/'));
        $model = null;


        if (count($domens) == 1) {
            $categoryLangModel = CategoryLangWrapper::find()->joinWith('category cat')->where(['alias' => $domens[0]])->andWhere(['OR', 'cat.parent_id is null', 'cat.parent_id=0'])->one();
            if (isset($categoryLangModel)) {
                $model = $categoryLangModel->category;
            }
        } else {

            $categoryLangModel = CategoryLangWrapper::find()->joinWith('category cat')->where(['alias' => $domens[0]])->andWhere(['OR', 'cat.parent_id is null', 'cat.parent_id=0'])->one();
---
SELECT `tbl_category_lang`.* FROM `tbl_category_lang` LEFT JOIN `tbl_category` `cat` ON `tbl_category_lang`.`category_id` = `cat`.`id` WHERE (`alias`='about') AND ((cat.parent_id is null) OR (cat.parent_id=0))