frontend/views/layouts/fullpage.php

SELECT `tbl_item`.* FROM `tbl_item` LEFT JOIN `tbl_category` `cat` ON `tbl_item`.`category_id` = `cat`.`id` WHERE ((`tbl_item`.`status`=1) AND (`tbl_item`.`is_menu`=1)) AND (`cat`.`code`='infopage') ORDER BY `id` DESC
---

    $catNavItems = [];
    //item menu
    $pageMenuList = \common\models\wrappers\ItemWrapper::find()->joinWith('category cat')->where(['tbl_item.status' => 1, 'tbl_item.is_menu' => 1])->andWhere(['cat.code' => "infopage"])->orderBy('id desc')->all();

SELECT * FROM `tbl_category` WHERE (`parent_id`=1) AND (`top`=1) AND (`status`=1)
---

            //submenu start
            $subItems = [];
            $categoryItems = \common\models\wrappers\CategoryWrapper::find()->where(['parent_id' => $categoryModel->id, 'top' => 1, 'status' => 1])->all();