frontend/views/common/footer.php

use yii\helpers\Html;
use yii\helpers\Url;

$ownerDetails = \common\models\OwnerContact::find()->one();
$serviceItems = ItemWrapper::find()->joinWith('category cat')->where(['cat.code' => 'service', 'tbl_item.status' => 1])->limit(5)->all();
---
SELECT * FROM `tbl_owner_contact`
SELECT `tbl_item`.* FROM `tbl_item` LEFT JOIN `tbl_category` `cat` ON `tbl_item`.`category_id` = `cat`.`id` WHERE (`cat`.`code`='service') AND (`tbl_item`.`status`=1) LIMIT 5