frontend/views/common/header.php

SELECT * FROM `tbl_owner_contact`
---
use yii\widgets\Menu;
use yii\bootstrap\ActiveForm;

$ownerDetails = \common\models\OwnerContact::find()->one();