frontend/views/common/indexHeader.php

use yii\helpers\Url;
use yii\widgets\Menu;

$ownerDetails = \common\models\OwnerContact::find()->one();
---
SELECT * FROM `tbl_owner_contact`