frontend/views/site/index.php

  </section>
  <section class="about">
       <?php
$ownInfo = \common\models\OwnerContact::find()->one();
---
SELECT * FROM `tbl_owner_contact`