frontend/views/site/index.php

SELECT * FROM `tbl_owner_contact`
---
  </section>
  <section class="about">
       <?php
$ownInfo = \common\models\OwnerContact::find()->one();